-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- ホスト: 127.0.0.1
-- 生成日時: 2021-11-16 06:24:34
-- サーバのバージョン： 10.4.19-MariaDB
-- PHP のバージョン: 8.0.7

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `postlog`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `reply`
--

CREATE TABLE `reply` (
  `id` int(11) NOT NULL,
  `title` varchar(256) NOT NULL,
  `post_user_name` varchar(256) NOT NULL,
  `name` varchar(256) NOT NULL,
  `reply` varchar(256) NOT NULL,
  `date` datetime NOT NULL DEFAULT current_timestamp(),
  `distinationDate` datetime NOT NULL DEFAULT current_timestamp(),
  `delete_flag` tinyint(1) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- テーブルのデータのダンプ `reply`
--

INSERT INTO `reply` (`id`, `title`, `post_user_name`, `name`, `reply`, `date`, `distinationDate`, `delete_flag`) VALUES
(1, '投稿', 'abc', 'abc', '投稿', '2021-11-09 13:58:38', '2021-11-09 13:58:22', 1),
(2, '投稿', 'abc', 'abc', '投稿', '2021-11-09 14:03:32', '2021-11-09 14:03:18', 1),
(3, '投稿', 'abc', 'abc', '投稿', '2021-11-10 11:10:51', '2021-11-10 11:10:42', 1),
(4, '投稿', 'abc', 'abc', '投稿', '2021-11-10 11:11:22', '2021-11-10 11:11:13', 1),
(5, '投稿2', 'abc', 'abc', '投稿\r\n\r\n', '2021-11-10 11:12:54', '2021-11-09 13:58:31', 1),
(6, '投稿', '安武数人', '安武数人', '投稿', '2021-11-11 09:01:27', '2021-11-11 09:01:13', 1),
(7, '投稿', 'abc', '安武数人', '返信テスト', '2021-11-11 09:03:55', '2021-11-10 11:10:42', 0);

-- --------------------------------------------------------

--
-- テーブルの構造 `userlog`
--

CREATE TABLE `userlog` (
  `id` bigint(20) NOT NULL,
  `title` varchar(256) CHARACTER SET utf8 NOT NULL,
  `name` varchar(256) NOT NULL,
  `text` varchar(256) NOT NULL,
  `date` datetime NOT NULL DEFAULT current_timestamp(),
  `delete_flag` tinyint(1) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- テーブルのデータのダンプ `userlog`
--

INSERT INTO `userlog` (`id`, `title`, `name`, `text`, `date`, `delete_flag`) VALUES
(1, '投稿', 'abc', '投稿', '2021-11-09 13:58:22', 0),
(2, '投稿2', 'abc', '投稿', '2021-11-09 13:58:31', 0),
(3, '投稿', 'abc', '投稿', '2021-11-09 14:03:18', 0),
(4, '投稿', 'abc', '投稿', '2021-11-10 11:10:42', 0),
(5, '投稿', 'abc', '投稿', '2021-11-10 11:11:13', 0),
(6, '投稿', '安武数人', '投稿', '2021-11-11 09:01:13', 0),
(7, 'a', '安武数人', '\r\na\r\n', '2021-11-11 09:15:41', 0),
(8, 'q', '安武数人', '\r\ns\r\n', '2021-11-11 09:15:47', 0),
(9, 'a', '安武数人', 'a', '2021-11-11 09:15:56', 0),
(10, 'a', '安武数人', 'a', '2021-11-11 09:16:00', 0),
(11, 'a', '安武数人', 'a', '2021-11-11 09:16:06', 0),
(12, 'あ', '安武数人', 'ｓ', '2021-11-11 09:53:57', 0),
(13, 'あ', '安武数人', 'ア」', '2021-11-11 09:54:03', 0),
(14, 'あ', '安武数人', 'あ', '2021-11-11 09:54:11', 0),
(15, 'あ', '安武数人', 'あ', '2021-11-11 09:54:17', 0),
(16, 'あ', '安武数人', 'あ', '2021-11-11 09:54:21', 0),
(17, 'ありがとうございます', '安武数人', 'あ', '2021-11-11 09:54:29', 0),
(18, 'あ', '安武数人', 'あ', '2021-11-11 09:54:32', 0),
(19, 'あ', '安武数人', 'あ', '2021-11-11 09:54:35', 0),
(20, 'あ', '安武数人', 'あ', '2021-11-11 09:54:38', 0),
(21, 'ああ', '安武数人', 'あ', '2021-11-11 09:54:42', 0),
(22, 'あ', '安武数人', 'あ', '2021-11-11 09:54:48', 0),
(23, 'あ', '安武数人', 'あ', '2021-11-11 09:54:55', 0),
(24, 'あ', '安武数人', 'ああ', '2021-11-11 09:54:59', 0),
(25, 'あ', '安武数人', 'あ', '2021-11-11 09:55:06', 0),
(26, 'あ', '安武数人', 'あ', '2021-11-11 09:55:09', 0),
(27, 'あ', '安武数人', 'あ', '2021-11-11 09:55:12', 0),
(28, 'あ', '安武数人', 'あ', '2021-11-11 09:55:16', 0),
(29, 'あ', '安武数人', 'あ', '2021-11-11 09:55:19', 0),
(30, 'ああ', '安武数人', 'あ', '2021-11-11 09:55:23', 0),
(31, 'あ', '安武数人', 'あ', '2021-11-11 09:55:27', 0),
(32, 'あ', '安武数人', 'あ', '2021-11-11 09:55:32', 0),
(33, 'あ', '安武数人', 'あ', '2021-11-11 09:55:36', 0),
(34, 'あ', '安武数人', 'あ', '2021-11-11 09:55:41', 0),
(35, 'あ', '安武数人', 'あ', '2021-11-11 09:55:45', 0),
(36, 'あ', '安武数人', 'あ', '2021-11-11 09:55:49', 0),
(37, 'あ', '安武数人', 'あ', '2021-11-11 09:56:09', 0),
(38, 'あ', '安武数人', 'あ', '2021-11-11 09:56:12', 0),
(39, 'あ', '安武数人', 'あ', '2021-11-11 09:56:16', 0),
(40, 'あ', '安武数人', 'あ', '2021-11-11 09:56:20', 0),
(41, 'ああ', '安武数人', 'あ', '2021-11-11 09:56:23', 0),
(42, 'あ', '安武数人', 'あ', '2021-11-11 09:56:27', 0),
(43, 'あ', '安武数人', 'あ', '2021-11-11 09:56:30', 0),
(44, 'あ', '安武数人', 'あ', '2021-11-11 09:56:34', 0),
(45, 'あ', '安武数人', 'あ', '2021-11-11 09:56:38', 0),
(46, 'あ', '安武数人', 'あ', '2021-11-11 09:56:41', 0),
(47, 'あ', '安武数人', 'あ', '2021-11-11 09:56:44', 0),
(48, 'あ', '安武数人', 'あ', '2021-11-11 09:56:47', 0),
(49, 'あ', '安武数人', 'あ', '2021-11-11 09:56:50', 0),
(50, 'あ', '安武数人', 'あ', '2021-11-11 09:56:55', 0),
(51, 'あ', '安武数人', 'あ', '2021-11-11 09:56:58', 0),
(52, 'あ', '安武数人', 'あ', '2021-11-11 09:57:01', 0),
(53, 'あ', '安武数人', 'あ', '2021-11-11 09:57:04', 0),
(54, 'あ', '安武数人', 'あ', '2021-11-11 09:57:08', 0),
(55, 'あ', '安武数人', 'あ', '2021-11-11 09:57:12', 0),
(56, 'あ', '安武数人', 'あ', '2021-11-11 09:57:25', 0),
(57, 'あ', '安武数人', 'あ', '2021-11-11 09:57:29', 0),
(58, 'あ', '安武数人', 'あ', '2021-11-11 09:57:34', 0),
(59, 'あ', '安武数人', 'あ', '2021-11-11 09:57:40', 0),
(60, 'あ', '安武数人', 'あ', '2021-11-11 09:57:43', 0),
(61, 'あ', '安武数人', 'あ', '2021-11-11 09:57:46', 1),
(62, 'あ', '安武数人', 'あ', '2021-11-11 09:57:50', 1),
(63, 'あ', '安武数人', 'あ', '2021-11-11 09:57:54', 0),
(64, '投稿テスト', '安武数人', 'テスト', '2021-11-16 12:07:55', 0),
(65, 'あ', '安武数人', 'あ', '2021-11-16 14:17:45', 0);

--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `reply`
--
ALTER TABLE `reply`
  ADD PRIMARY KEY (`id`);

--
-- テーブルのインデックス `userlog`
--
ALTER TABLE `userlog`
  ADD PRIMARY KEY (`id`);

--
-- ダンプしたテーブルの AUTO_INCREMENT
--

--
-- テーブルの AUTO_INCREMENT `reply`
--
ALTER TABLE `reply`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- テーブルの AUTO_INCREMENT `userlog`
--
ALTER TABLE `userlog`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=66;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
